{
  "projects": [
    {
      "title": "Quick Prompt",
      "body": "A desktop app made with Electron and Angular that shows an input modal wherever you are so you can ask GPT for help.",
      "media": "assets/projectMedia/angular-quick-prompt.gif",
      "link": "https://github.com/duMagnus/quick-prompt",
      "buttonText": "See it on GitHub"
    },
    {
      "title": "Resumix",
      "body": "My first actual mobile app, the previous one was following along a course. Resumix is an app that lets you record audio and get a summary of what was said in just a few seconds and it also stores the transcription of the audio so you can always go back for any details. Whether you want to capture the main points of a lecture, a meeting, or a podcast, it can help save time and keep things organized. It uses the OpenAI's Whisper API to transcribe audio into text, and then the GPT API to generate a concise and accurate summary.",
      "media": "assets/projectMedia/resumix.gif",
      "link": "https://github.com/duMagnus/Resumix",
      "buttonText": "See it on GitHub"
    },
    {
      "title": "Perlin Noise Terrain Generation",
      "body": "A terrain generator which uses the Perlin Noise algorithm to create the 'mountais'.",
      "media": "assets/projectMedia/perlin-noise-terrain.gif",
      "link": "https://editor.p5js.org/duMagnus/sketches/LfHcBcsFL",
      "buttonText": "See Sketch"
    },
    {
      "title": "Anagrams",
      "body": "What started as a python console game for school became my first app integrating openAI's API. Here I tried to create two ways to get new words. The first one was with my (mostly) original algorithm from the school project, with preloaded words and an algorithm to randomly pick one and shuffle it. The second one was offsetting the processing all to openAI. I managed to not only get a new random word from them, but in any language, in json formatting and shuffled.",
      "media": "assets/projectMedia/anagrams.gif",
      "link": "https://github.com/duMagnus/anagrams-be",
      "buttonText": "See it on GitHub"
    },
    {
      "title": "Angular Tic Tac Toe",
      "body": "A simple tic tac toe game made in Angular, as a way of learning the framework.",
      "media": "assets/projectMedia/angular-tic-tac-toe.gif",
      "link": "https://github.com/duMagnus/angular-tic-tac-toe",
      "buttonText": "See it on GitHub"
    }
  ]
}
